
# Markdown+
#
# Developed for the Deutsche Precision MES by C. Ryan Deardorff
#
# http://deutscheprecision.com

SYMBOLS = {
	'': [
		['°', '&deg;', 'Degree'],
		['•', '&bull;', 'Bullet']
	],
	'Math': [
		['×', '&times;'],
		['÷', '&div;'],
		['≠', '&ne;'],
		['±', '&plusmn;'],
		['¬', '&not;'],
		['≤', '&le;'],
		['≥', '&ge;'],
		['²', '&sup2;'],
		['³', '&sup3;'],
		['ƒ', '&fnof;'],
		['∀', '&forall;'],
		['∁', '&comp;'],
		['∂', '&part;'],
		['∃', '&exist;'],
		['∄', '&nexist;'],
		['∅', '&empty;'],
		['∆', '&#8710;'],
		['∇', '&nabla;'],
		['∈', '&isin;'],
		['∉', '&notin;'],
		['∑', '&sum;'],
		['∘', '&compfn;'],
		['∙', '&#8729;'],
		['√', '&radic;'],
		['∛', '&#8731;'],
		['∜', '&#8732;'],
		['∝', '&prop;'],
		['∞', '&infin;'],
		['≃', '&sime;'],
		['≄', '&nsime;'],
		['≈', '&asymp;'],
		['≅', '&cong;'],
		['∫', '&int;']
	],
	'Acceleration': [
		['㎨', '&#13224;'],
		['㎯', '&#13231;']
	],
	'Ampere': [
		['㎀', '&#13184;'],
		['㎁', '&#13185;'],
		['㎂', '&#13186;'],
		['㎃', '&#13187;'],
		['㎄', '&#13188;']
	],
	'Area': [
		['㍸', '&#13176;'],
		['㎟', '&#13215;'],
		['㎠', '&#13216;'],
		['㎡', '&#13217;'],
		['㎢', '&#13218;'],
		['㏊', '&#13258;']
	],
	'Byte': [
		['㎅', '&#13189;'],
		['㎆', '&#13190;'],
		['㎇', '&#13191;']
	],
	'Capacitance': [
		['㎊', '&#13194;'],
		['㎋', '&#13195;'],
		['㎌', '&#13196;']
	],
	'Electrical Resistance': [
		['Ω', '&#8486;'],
		['㏀', '&#13248;'],
		['㏁', '&#13249;']
	],
	'Frequency': [
		['㎐', '&#13200;'],
		['㎑', '&#13201;'],
		['㎒', '&#13202;'],
		['㎓', '&#13203;'],
		['㎔', '&#13204;']
	],
	'Illuminance': [
		['㏅', '&#13253;'],
		['㏐', '&#13264;'],
		['㏓', '&#13267;']
	],
	'Length': [
		['㍳', '&#13171;'],
		['㍶', '&#13174;'],
		['㍷', '&#13175;'],
		['㎙', '&#13209;'],
		['㎚', '&#13210;'],
		['㎛', '&#13211;'],
		['㎜', '&#13212;'],
		['㎝', '&#13213;'],
		['㎞', '&#13214;'],
		['㏌', '&#13260;']
	],
	'Magnetic Field': [
		['㏝', '&#13277;'],
		['㏟', '&#13279;']
	],
	'Mass': [
		['㎍', '&#13197;'],
		['㎎', '&#13198;'],
		['㎏', '&#13199;'],
		['㏙', '&#13273;']
	],
	'Measuring': [
		['㎭', '&#13229;'],
		['㏛', '&#13275;'],
		['㏿', '&#13311;']
	],
	'Misc.': [
		['㍵', '&#13173;'],
		['㍺', '&#13178;'],
		['㏇', '&#13255;'],
		['㏈', '&#13256;'],
		['㏍', '&#13261;'],
		['㏎', '&#13262;'],
		['㏏', '&#13263;'],
		['㏑', '&#13265;'],
		['㏒', '&#13266;'],
		['㏕', '&#13269;'],
		['㏖', '&#13270;'],
		['㏗', '&#13271;'],
		['㏚', '&#13274;']
	],
	'Power': [
		['㎺', '&#13242;'],
		['㎻', '&#13243;'],
		['㎼', '&#13244;'],
		['㎽', '&#13245;'],
		['㎾', '&#13246;'],
		['㎿', '&#13247;'],
		['㏋', '&#13259;']
	],
	'Pressure': [
		['㍱', '&#13169;'],
		['㍴', '&#13172;'],
		['㎩', '&#13225;'],
		['㎪', '&#13226;'],
		['㎫', '&#13227;'],
		['㎬', '&#13228;'],
		['㏔', '&#13268;']
	],
	'Radiation': [
		['㏃', '&#13251;'],
		['㏆', '&#13254;'],
		['㏉', '&#13257;'],
		['㏜', '&#13276;']
	],
	'Speed': [
		['㎧', '&#13223;'],
		['㎮', '&#13230;']
	],
	'Time': [
		['㎰', '&#13232;'],
		['㎱', '&#13233;'],
		['㎲', '&#13234;'],
		['㎳', '&#13235;'],
		['㏂', '&#13250;'],
		['㏘', '&#13272;']
	],
	'Voltage': [
		['㎴', '&#13236;'],
		['㎵', '&#13237;'],
		['㎶', '&#13238;'],
		['㎷', '&#13239;'],
		['㎸', '&#13240;'],
		['㎹', '&#13241;'],
		['㏞', '&#13278;']
	],
	'Volume': [
		['㍹', '&#13177;'],
		['㎕', '&#13205;'],
		['㎖', '&#13206;'],
		['㎗', '&#13207;'],
		['㎘', '&#13208;'],
		['㎣', '&#13219;'],
		['㎤', '&#13220;'],
		['㎥', '&#13221;'],
		['㎦', '&#13222;'],
		['㏄', '&#13252;']
	],
	'Greek (Upper)': [
		['Γ', '&Gamma;'],
		['Δ', '&Delta;'],
		['Θ', '&Theta;'],
		['Λ', '&Lambda;'],
		['Ξ', '&Xi;'],
		['Π', '&Pi;'],
		['Σ', '&Sigma;'],
		['Φ', '&Phi;'],
		['Ψ', '&Psi;'],
		['Ω', '&Omega;']
	],
	'Greek (Lower)': [
		['α', '&alpha;'],
		['β', '&beta;'],
		['γ', '&gamma;'],
		['δ', '&delta;'],
		['ε', '&epsilon;'],
		['ζ', '&zeta;'],
		['η', '&eta;'],
		['θ', '&theta;'],
		['ι', '&iota;'],
		['κ', '&kappa;'],
		['λ', '&lambda;'],
		['μ', '&mu;'],
		['ν', '&nu;'],
		['ξ', '&xi;'],
		['π', '&pi;'],
		['ρ', '&rho;'],
		['σ', '&sigma;'],
		['τ', '&tau;'],
		['υ', '&upsilon;'],
		['φ', '&phi;'],
		['χ', '&chi;'],
		['ψ', '&psi;'],
		['ω', '&omega;']
	],
	'Fraction': [
		['½', '&frac12;'],
		['⅓', '&frac13;'],
		['⅔', '&frac23;'],
		['¼', '&frac14;'],
		['¾', '&frac34;'],
		['⅕', '&frac13;'],
		['⅖', '&frac25;'],
		['⅗', '&frac35;'],
		['⅘', '&frac45;'],
		['⅙', '&frac16;'],
		['⅚', '&frac35;'],
		['⅐', '&frac17;'],
		['⅛', '&frac18;'],
		['⅑', '&#8529;'],
		['⅒', '&#8530;']
	]
}

def getAllSymbols():
	symbols = []
	for key in SYMBOLS.keys():
		for s in SYMBOLS[key]:
			symbols.append(s[0])
	return symbols
	
def getAllSymbolCodes():
	codes = []
	for key in SYMBOLS.keys():
		for s in SYMBOLS[key]:
			codes.append(s[1])
	return codes

def htmlEncode(s):
	for symbol in getAllSymbols():
		s = s.replace(symbol, htmlEncodeChar(symbol))
	return s

def htmlEncodeChar(c):
	for key in SYMBOLS.keys():
		r = encodeChar(c, SYMBOLS[key])
		if r is not None:
			return r
	return c
	
def encodeChar(c, symbols):
	for s in symbols:
		if s[0] == c:
			return s[1]
	return None
		
def htmlDecode(s):
	if s is None:
		return ''
	for code in getAllSymbolCodes():
		s = s.replace(code, htmlDecodeEntity(code))
	return s
		
def htmlDecodeEntity(entity):
	for key in SYMBOLS.keys():
		r = decodeEntity(entity, SYMBOLS[key])
		if r is not None:
			return r
	return entity
	
def decodeEntity(entity, symbols):
	for s in symbols:
		if s[1] == entity:
			return s[0]
	return None